{
    "news_source": "DataWorld - CNN Articles",
    "articles": [
        {
            "article_id": "0d641f2c-1b43-5651-adb5-18ccea4df489",
            "title": "Fleetwood and Hoey lead big names in Dunhill Links",
            "url": "https://edition.cnn.com/2011/09/30/sport/golf/dunhill/index.html",
            "content": "Hollywood A-listers hit the green ...By Matthew Knight, CNNUpdated 1203 GMT (2003 HKT) October 5, 2011  Photos: Celebs and sports starsMichael Douglas and Andy Garcia take to world golf's oldest and arguably greatest stage as they practise on the Old Course at St. Andrews, Scotland in preparation for the Alfred Dunhill Links Championships.Hide Caption 1 of 10 Photos: Celebs and sports starsOne of the most welcome arrivals this week has been the sun as players and spectators bask in unseasonably warm conditions at St. Andrews. Hide Caption 2 of 10 Photos: Celebs and sports starsRory McIlroy will partner his father Gerry (left) in the pro-am team competition which runs alongside the European Tour strokeplay event. Hide Caption 3 of 10 Photos: Celebs and sports starsKingsbarns Golf Links (seen here from above) is one of three courses used for the event. Hide Caption 4 of 10 Photos: Celebs and sports starsActor Hugh Grant will be hoping to avoid hacking of a very different sort this weekend.Hide Caption 5 of 10 Photos: Celebs and sports starsDutch football legend Ruud Gullit in discussion with world number one Luke Donald.Hide Caption 6 of 10 Photos: Celebs and sports starsJohn Daly, winner of the 1995 Open Championship at St. Andrews, practises with his eight-year-old son, John Daly Jnr. Hide Caption 7 of 10 Photos: Celebs and sports starsReigning British Open champion Darren Clarke signs autographs before his practise round. Hide Caption 8 of 10 Photos: Celebs and sports starsCarnoustie, a regular British Open venue, completes up the trio of courses on which professionals and amateurs compete.Hide Caption 9 of 10 Photos: Celebs and sports starsEx-cricketers-turned-TV commentators Ian Botham and Shane Warne (right) on more familiar turf at the Rose Bowl, Southampton during the summer of 2011. Both will be playing at the Alfred Dunhill Links Championship. Hide Caption 10 of 10Story highlightsGolf stars mix with A-listers from film and sport at European Tour event in Scotland Five out of six of world's top-ranked players playing in $5m Alfred Dunhill Links ChampionshipMichael Douglas paired with 2005 winner Colin Montgomerie, Rory McIlroy plays with fatherDefending champion Martin Kaymer  says that being back on The Old Course at St Andrews is\"paradise,\" while Hugh Grant likens the opportunity to compete as \"dying and going to golfing heaven.\"   The Alfred Dunhill Links Championship is a tournament like no other on the European Tour where the world's top golfers rub shoulders with acting and sporting legends in a four-day pro-am played over three Scottish links -- St Andrews, Carnoustie and Kingsbarns.  Five of the six top ranked players in the world -- Luke Donald, Lee Westwood, Rory McIlroy,  America's Dustin Johnson and defending champion Kaymer -- will challenge for a share of the $5m prize pot.   This year, amateurs making a star turn include former Dutch footballer Johan Cruyff, cricketer Shane Warne from Australia and Hollywood greats Andy Garcia and Michael Douglas.\"It does not get better than this. This is just a magical place and when we get a week like we are getting now, it's going to be great,\" Michael Douglas said.   JUST WATCHEDCelebs compete on St. AndrewsReplayMore Videos ...MUST WATCHCelebs compete on St. Andrews 00:10Pros compete against each other in a traditional 72-hole strokeplay competition while also pairing off with an amateur to compete in a team event.Former England cricketer Ian Botham will play alongside John Daly, while 2005 winner Colin Montgomerie will once again pair Michael Douglas, who returns to play in the event after his much-publicized illness.   \"I had my cancer bout so I used the Dunhill as a motivation to get my game together. I am playing with Colin Montgomerie. I played with him back in 2005 when he actually won this event. One of my big treats was to be his partner,\" Douglas said.Simon Dyson, the 2009 champion and recent winner of the Dutch Open will pair up with rock star Huey Lewis.\"Every time I play here, it haunts me. If you could get up at four or five in the morning and look west, you would see all the folds and ridges - its like nothing you could ever create. It's perfect,\" Lewis said.Not all the star golfers are teaming up with A-listers. Many, including Martin Kaymer, Ernie Els and Rory McIlroy,  have chosen more familiar faces, to them at least, and will tee off with their fathers.  But the prize for most unexpected and welcome visitor of the week goes to...the sun. Players and spectators have been basking in unseasonably warm temperatures (so far) at an event where bobble hats and waterproofs are usually essential. Powered by Livefyre"
        },
        {
            "article_id": "2419cdcf-50a7-5b04-a9fc-fd7813731fe9",
            "title": "Senna to replace Heidfeld in Belgium",
            "url": "https://edition.cnn.com/2011/09/30/sport/golf/dunhill/index.html",
            "content": "Senna to replace Heidfeld in BelgiumBy Updated 1649 GMT (0049 HKT) August 26, 2011 Bruno Senna is the nephew of Ayrton Senna, the three-time world champion who died in 1994.Story highlightsBruno Senna will replace Nick Heidfeld for Renault at the Belgian Grand PrixBruno is the nephew of late Formula legend Ayrton SennaThe Brazilian has not raced since the final grand prix of the 2010 seasonBrazilian driver Bruno Senna will replace Nick Heidfeld for Renault at this weekend's Formula One grand prix in Belgium.Senna, the nephew of three-time world champion Ayrton Senna, joined the British-based team as a test driver in July and has yet to race competitively for the marque.German racer Heidfeld has picked up 34 points so far this season and secured a podium finish when he crossed the line in third position at April's Malaysian Grand Prix.Senna's last race was the season-ending Abu Dhabi Grand Prix in November 2010, where he placed 19th for HRT.Remembering Senna: King of MonacoThe Sao Paulo-born driver competed for Spanish outfit HRT on 18 occasions last season with his best finish of the season a 14th place in South Korea.Heidfeld, formerly of Sauber, was drafted in by Renault at the start of the 2011 season as a replacement for Robert Kubica, after the Pole suffered injuries to his arms and legs in a rally crash in February.After his rookie year with Prost in 2000, Heidfeld spent three years with Sauber before joining Jordan in 2004.The 34-year-old spent a season with Williams in 2005 and returned for a second spell with Sauber, who had be taken over by BMW, in 2006.Powered by Livefyre"
        },
        {
            "article_id": "fc9c8863-007f-540f-9f6f-4981f2ae6cb6",
            "title": "Zvonareva beats Kvitova to reach Tokyo final",
            "url": "https://edition.cnn.com/2011/09/30/sport/tennis/tennisroundup/index.html",
            "content": "Zvonareva beats Kvitova to reach Tokyo finalBy Updated 2022 GMT (0422 HKT) September 30, 2011 Vera Zvonareva powers a shot during her straight sets win over Petra Kvitova in TokyoStory highlightsVera Zvonareva sees off Wimbledon champion Petra Kvitova in straight sets in Tokyo semis Russian comes from 5-1 down in opening set to win it on a tiebreaker Maria Sharapova pulls out of China Open with ankle injuryAndy Murray into the semifinals of  ATP tournament in ThailandRussian Vera Zvonareva came from 5-1 down in the opening set to beat Wimbledon champion Petra Kvitova 7-6 6-0 in the semifinals of the WTA  tournament in Tokyo Friday.Zvonareva will reach a career high No.2 in the rankings if she wins the Toray Pan Pacific title and will face  Agnieszka Radwanska in the final.Polish star Radwanska shocked third seed Victoria Azarenka 6-3 4-6 6-2 in the other semifinal.Ninth seed Radwanska led 6-3 4-2 until Azarenka launched a fight back to win the second set, but two breaks of service saw her home in the decider on her fourth match point.Zvonareva looked in big trouble in the opening stages of her match against Kvitova and faced three set points on her Czech opponent's service until winning it on a tiebreak.The second set was completely one-sided as she breezed into her 30th carrer final.\"I don't even remember being down 5-1 in the first set!\" Zvonareva told the WTA official website.\"But I slowly got into the match, making the shots I usually make. Then I was able to turn it around.\"I think I played very consistently in the second set and Petra started to make a few more mistakes. We had some tough games, but I was able to convert all my chances, and that's why the scoreline looked like that in the end.\"Despite the loss, Kvitova's run to the semifinal will lift her into the top five in the WTA rankings for the first time.Meanwhile, former world number one Maria Sharapova has pulled out of next week's China Open with an ankle injury she picked up in in her quarterfinal against Kvitova.The 24-year-old Russian was force to retire after twisting her ankle, but is hopeful she can return to the circuit before the end of the season.\"Will do my best to recover in time for Istanbul (the season-ending WTA Championships),\" Sharapova said on her website.On the men's ATP Tour, world number four Andy Murray breezed into the semifinals of the Thailand Open in Bangkok.The top seed beat Bulgaria's Grigor Dimitrov 6-4 6-4 in one hour and 28 minutes as he remained on course to win his third title of the season.Powered by Livefyre"
        }
    ]
}